# Parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4

   [-1, 3, GhostBottleneck, [128, 3, 1]],
   [-1, 1, GhostBottleneck, [256, 3, 2]],  # 3-P3/8
   [-1, 9, GhostBottleneck, [256, 3, 1]],
   [-1, 1, SElayer, [256, 16]],
   [-1, 1, GhostBottleneck, [512, 3, 2]],   # 6-P4/16
   [-1, 9, GhostBottleneck, [512, 3, 1]],
   [-1, 1, SElayer, [512, 16]],

   [-1, 1, Conv, [1024, 3, 2]],  # 9-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 1, SElayer, [1024, 16]],

  ]

# YOLOv5 head
head:
   [[-1, 3, GhostBottleneck, [1024, 3, 1]],  #12

   [-1, 1, DWConv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, DWConv, [512, 3, 1]],
   [-1, 3, GhostBottleneck, [512, 3, 1]],  # 17

   [-1, 1, DWConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, DWConv, [256, 3, 1]],
   [-1, 3, GhostBottleneck, [256, 3, 1]],
#   [-1, 1, nn.Conv2d, [na * (nc + 5), 1, 1]], #23

   [-2, 1, DWConv, [256, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P4
   [-1, 3, GhostBottleneck, [512, 3, 1]],
#   [-1, 1,nn.Conv2d, [na * (nc + 5), 1, 1]], #27

   [-2, 1, DWConv, [512, 3, 2]],
   [[-1, 13], 1, Concat, [1]],  # cat head P5
   [-1, 3, GhostBottleneck, [1024, 3, 1]],  # 23 (P5/32-large)
#   [-1, 1,nn.Conv2d, [na * (nc + 5), 1, 1]],

   [[22,25,28], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
